src/Documents/ПриходныйКассовыйОрдер/ПриходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходныйКассовыйОрдер</name>
  <basedOn>Document.ГТД</basedOn>
  <basedOn>Document.СчетНаОплату</basedOn>
  <registerRecords>AccumulationRegister.ДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидОперацииПриходныйКассовыйОрдер</types>
    </type>
  </attributes>
  <attributes>
    <name>ГТД</name>
    <type>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОперации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолгПоВалютам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаПеремещение</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКвитанции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПоступлениеУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьяДДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДолгГТД</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоллар</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНаОплату</name>
    <type>
      <types>DocumentRef.СчетНаОплату</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Транспорт</name>
    <attributes>
      <name>Транспорт</name>
      <type>
        <types>DefinedType.Транспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оплаты</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КурсКоммерческийПокупка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсКоммерческийПродажа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ВидОперацииПриходныйКассовыйОрдер/ВидОперацииПриходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидОперацииПриходныйКассовыйОрдер</name>
  <enumValues>
    <name>Конвертация</name>
  </enumValues>
  <enumValues>
    <name>ОплатаКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеИзКассы</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВидОперацииДоходыРасходы/ВидОперацииДоходыРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидОперацииДоходыРасходы</name>
  <enumValues>
    <name>БрокерскиеУслуги</name>
  </enumValues>
  <enumValues>
    <name>Оплата</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеГТД</name>
  </enumValues>
  <enumValues>
    <name>Платеж</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>Проценты3</name>
  </enumValues>
  <enumValues>
    <name>РасходДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ЭкспедиторскиеУслуги</name>
  </enumValues>
</mdclass:Enum>

src/Documents/Заявка/Заявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заявка</name>
  <attributes>
    <name>ВидЗаявки</name>
    <type>
      <types>CatalogRef.ВидыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>DefinedType.КоличествоГруза</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоТранспорта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоДокументу</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКонтрагента</name>
    <type>
      <types>EnumRef.ТипКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаДоллар</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Транспорт</name>
    <attributes>
      <name>Вес</name>
      <type>
        <types>DefinedType.КоличествоГруза</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесПеревес</name>
      <type>
        <types>DefinedType.КоличествоГруза</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесПЛ</name>
      <type>
        <types>DefinedType.КоличествоГруза</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидТранспорта</name>
      <type>
        <types>EnumRef.ВидТранспорта</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗакрытия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПолученияДокументов</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРейса</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Линия</name>
      <type>
        <types>CatalogRef.Линия</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоДоставки</name>
      <type>
        <types>CatalogRef.ГородаОбластиРайоны</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемКонтейнера</name>
      <type>
        <types>EnumRef.ОбъемКонтейнера</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Пакинг</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Порт</name>
      <type>
        <types>CatalogRef.Порты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтранаОтправления</name>
      <type>
        <types>CatalogRef.Страны</types>
      </type>
    </attributes>
    <attributes>
      <name>Транспорт</name>
      <type>
        <types>DefinedType.Транспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Экспедитор</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Валюты/Валюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Валюты</name>
  <predefined>
    <items>
      <name>Гривна</name>
      <description>Гривна</description>
    </items>
    <items>
      <name>Доллар</name>
      <description>Доллар</description>
    </items>
    <items>
      <name>Евро</name>
      <description>Евро</description>
    </items>
  </predefined>
  <attributes>
    <name>КодЧисловой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодСимвольный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Documents/ПриходныйКассовыйОрдер/ManagerModule.bsl
Функция Проведение ( Данные ) Экспорт
	
	получитьДанныеДокумента ( Данные );
	сформироватьДенежныеСредства ( Данные );
	сформироватьДвиженияДенежныхСредств ( Данные );
	Если ( Данные.Шапка.ВидОперации = Перечисления.ВидОперацииПриходныйКассовыйОрдер.Конвертация ) Тогда
		// код ...
	ИначеЕсли ( Данные.Шапка.ВидОперации = Перечисления.ВидОперацииПриходныйКассовыйОрдер.ПеремещениеИзКассы ) Тогда 
		// код ...
	Иначе
		//сформироватьВзаиморасчеты ( Данные );
		//сформироватьДоходыРасходы ( Данные );		
	КонецЕсли; 
	установитьФлагиЗаписи ( Данные );
	Возврат Истина;
	
КонецФункции

Процедура получитьДанныеДокумента ( Данные )
	
	текст = "
	|// ~Шапка
	|ВЫБРАТЬ 
	|	Ссылка как Ссылка, Номер как Номер, Дата как Период,
	|	ДатаОперации как ДатаОперации, ГТД как ГТД, Дата как Дата, 
	|	Касса как Касса, Контрагент как Контрагент, НазначениеПлатежа как НазначениеПлатежа,
	|	НомерКвитанции как НомерКвитанции, Основание как Основание, Сумма как Сумма, 
	|	Валюта как Валюта, Организация как Организация, СтатьяДДС как СтатьяДДС,
	|	СуммаДоллар как СуммаДоллар, ВидОперации как ВидОперации,
	|	ДолгПоВалютам как ДолгПоВалютам 
	|из
	|	Документ.ПриходныйКассовыйОрдер
	|где
	|	Ссылка = &Ссылка
	|;
	|выбрать
	|	Транспорт как Транспорт, Сумма как Сумма,
	|	СуммаДоллар как СуммаДоллар
	|из
	|	Документ.ПриходныйКассовыйОрдер.Транспорт
	|где
	|	Ссылка = &Ссылка
	|упорядочить по
	|	НомерСтроки
	|;
	|выбрать
	|	Курс как Курс
	|из
	|	РегистрСведений.КурсыВалют.СрезПоследних ( &Дата, Валюта = значение ( Справочник.Валюты.Доллар ) )
	|;
	|выбрать
	|	Валюта как Валюта,
	|	Сумма как Сумма
	|из
	|	Документ.ПриходныйКассовыйОрдер.Оплаты
	|где
	|	Ссылка = &Ссылка  
	|";
	запрос = Новый Запрос ( текст );
	запрос.УстановитьПараметр ( "Ссылка", Данные.Ссылка );
	запрос.УстановитьПараметр ( "Дата", Данные.Дата );
	результат = запрос.ВыполнитьПакет ();
	выборкаШапка = результат [ 0 ].Выбрать ();
	выборкаШапка.Следующий ();
	Данные.Вставить ( "Шапка", выборкаШапка );
	Данные.Вставить ( "Транспорт", результат [ 1 ].Выгрузить () );
	выборкаКурс = результат [ 2 ].Выбрать ();
	выборкаКурс.Следующий ();
	Данные.Вставить ( "Курс", выборкаКурс.Курс );
	Данные.Вставить ( "Оплаты", результат [ 3 ].Выгрузить () );
	
КонецПроцедуры

Процедура сформироватьВзаиморасчеты ( Данные )
	
	п = Данные.Шапка;
	Если ( п.ДолгПоВалютам ) Тогда
		Для Каждого строкаТЗ Из Данные.Оплаты Цикл
			движение = Данные.Движения.Взаиморасчеты.ДобавитьРасход ();
			движение.Период = п.Дата;
			движение.Контрагент = п.Контрагент;
			движение.Валюта = строкаТЗ.Валюта;
			движение.Заявка = Документы.Заявка.ПустаяСсылка ();
			движение.Организация = п.Организация;
			движение.Сумма = строкаТЗ.Сумма;
		КонецЦикла;	
	Иначе
		Если ( п.Сумма <> 0 ) Тогда
			движение = Данные.Движения.Взаиморасчеты.ДобавитьРасход ();
			движение.Период = п.Дата;
			движение.Контрагент = п.Контрагент;
			движение.Валюта = п.Валюта;
			движение.Заявка = Документы.Заявка.ПустаяСсылка ();
			движение.Организация = п.Организация;
			движение.Сумма = п.Сумма;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

Процедура сформироватьДенежныеСредства ( Данные )
	
	п = Данные.Шапка;
	Если ( Данные.Шапка.ВидОперации = Перечисления.ВидОперацииПриходныйКассовыйОрдер.ПеремещениеИзКассы ) Тогда
		движение = Данные.Движения.ДенежныеСредства.ДобавитьПриход ();
		движение.Период = п.Дата;
		движение.Казна = п.Касса;
		движение.Валюта = п.Валюта;
		движение.Сумма = п.Сумма;
	Иначе
		Для Каждого строкаТЗ Из Данные.Оплаты Цикл
			движение = Данные.Движения.ДенежныеСредства.ДобавитьПриход ();
			движение.Период = п.Дата;
			движение.Казна = п.Касса;
			движение.Валюта = строкаТЗ.Валюта;
			движение.Сумма = строкаТЗ.Сумма;	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура сформироватьДвиженияДенежныхСредств ( Данные )
	
	п = Данные.Шапка;
	Если ( Данные.Шапка.ВидОперации = Перечисления.ВидОперацииПриходныйКассовыйОрдер.ПеремещениеИзКассы ) Тогда
		движение = Данные.Движения.ДвиженияДенежныхСредств.Добавить ();
		движение.Период = п.Дата;
		движение.Казна = п.Касса;
		движение.Валюта = п.Валюта;
		движение.Организация = п.Организация;
		движение.СтатьяДДС = п.СтатьяДДС;
		движение.Контрагент = п.Контрагент;
		движение.СуммаПриход = п.Сумма;
		движение.СуммаРасход = 0;
	Иначе
		Для Каждого строкаТЗ Из Данные.Оплаты Цикл
			движение = Данные.Движения.ДвиженияДенежныхСредств.Добавить ();
			движение.Период = п.Дата;
			движение.Казна = п.Касса;
			движение.Валюта = строкаТЗ.Валюта;
			движение.Организация = п.Организация;
			движение.СтатьяДДС = п.СтатьяДДС;
			движение.Контрагент = п.Контрагент;
			движение.СуммаПриход = строкаТЗ.Сумма;
			движение.СуммаРасход = 0;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура сформироватьДоходыРасходы ( Данные )
	
	п = Данные.Шапка;
	Для Каждого строкаТЧ Из Данные.Транспорт Цикл
		// доходы
		Если ( строкаТЧ.Сумма <> 0 ) Тогда
			движение = добавитьДвижение ( Данные, строкаТЧ );
			движение.Валюта = Справочники.Валюты.Гривна;
			движение.СуммаДоход = строкаТЧ.Сумма;
			движение.ВидОперации = Перечисления.ВидОперацииДоходыРасходы.Оплата;
			движение.Курс = 1;
		КонецЕсли;
		Если ( строкаТЧ.СуммаДоллар <> 0 ) Тогда
			движение = добавитьДвижение ( Данные, строкаТЧ );
			движение.Валюта = Справочники.Валюты.Доллар;
			движение.СуммаДоход = строкаТЧ.СуммаДоллар;
			движение.ВидОперации = Перечисления.ВидОперацииДоходыРасходы.Оплата;
			движение.Курс = Данные.Курс;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

Функция добавитьДвижение ( Данные, СтрокаТЧ )
	
	движение = Данные.Движения.ДоходыРасходы.Добавить ();
	движение.Период = Данные.Дата;
	движение.Заявка = Данные.Шапка.Заявка;
	движение.Организация = Данные.Шапка.Организация;
	движение.Транспорт = СтрокаТЧ.Транспорт;
	движение.Номенклатура = Справочники.Номенклатура.ПустаяСсылка ();
	Возврат движение;
	
КонецФункции

Процедура установитьФлагиЗаписи ( Данные )
	
	Данные.Движения.Взаиморасчеты.Записывать = Истина;
	Данные.Движения.ДенежныеСредства.Записывать = Истина;
	Данные.Движения.ДвиженияДенежныхСредств.Записывать = Истина;
	Данные.Движения.ДоходыРасходы.Записывать = Истина;
	
КонецПроцедуры
